/*
患者 -> 串者編號、患者姓名、地址、電話
醫生 -> 醫生編號、醫生姓名、門診科別
看診 -> 患者編號、醫生編號、領藥號碼、日期、時間、結果
藥單 -> 領藥號碼、說明
*/

# 1. 列出國慶日當天，依看診病患領藥號碼，由小至大排列的看診資料。
SELECT *
FROM 看診
WHERE 日期 = "10/10"
ORDER BY 領藥號碼 ASC;

# 2. 列出在一月一日到醫院看診的病患總人數。
SELECT COUNT(患者.患者編號)
FROM 患者, 看診
WHERE 患者.患者編號 = 看診.患者編號 AND 日期 = "1/1";

# 3. 列出目前每一位醫生所看診過的病患總人數。
SELECT COUNT(患者.患者編號)
FROM 患者, 看診;

# 4. 列出醫生在今年國慶日之前，看診病患總數超過一千人的醫生編號和病患的人數。
SELECT 醫生.醫生編號, COUNT(患者.患者編號)
FROM 醫生, 患者;

# 5. 列出患者張三所有的看診記錄。
SELECT 看診.*
FROM 患者, 看診
WHERE 患者.患者編號  = 看診.患者編號;

# 6. 列出被醫生李四所看診過的患者資料及看診紀錄。
SELECT 患者.*, 看診.*
FROM 患者, 醫生, 看診
WHERE 患者.患者編號 = 看診.患者編號 AND 看診.醫生編號 = 醫生.醫生編號 AND 醫生.醫生姓名 = "李四";

# 7. 列出所有看過外科的病患的患者資料。(使用 Subquery)
SELECT 患者.*
FROM 患者, 看診
WHERE 看診.醫生編號 IN (SELECT 醫生編號
					  FROM 醫生
					  WHERE 門診科別 = "外科");

# 8. 列出醫生其所看診的病患人數超過 3000 人的醫生資料。(使用Exists)。
SELECT *
FROM 醫生
WHERE EXISTS (SELECT *
			  FROM 患者
              WHERE COUNT(患者編號) > 3000);

# 9. 列出所有沒有看過牙科門診的患者資料。(使用 Not Exists)


# 10.列出所有沒有看過眼科門診的患者資料。(使用 Not In)


# 11.將醫院中病患李四患者資料中的電話資料修改成”07-1234567”。
UPDATE 病患
SET 電話 = "07-1234567"
WHERE 患者姓名 = "李四";

# 12.將藥單之領藥編號為 131 號的藥單資料刪除。
DELETE
FROM 藥單
WHERE 領藥號碼 = 131;

